src/Catalogs/ГруппыВнешнихПользователей/ГруппыВнешнихПользователей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ГруппыВнешнихПользователей</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <predefined>
    <items>
      <name>ВсеВнешниеПользователи</name>
      <description>Все внешние пользователи</description>
    </items>
  </predefined>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВсеОбъектыАвторизации</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Состав</name>
    <attributes>
      <name>ВнешнийПользователь</name>
      <type>
        <types>CatalogRef.ВнешниеПользователи</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Роли</name>
    <attributes>
      <name>Роль</name>
      <type>
        <types>CatalogRef.ИдентификаторыОбъектовМетаданных</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Назначение</name>
    <attributes>
      <name>ТипПользователей</name>
      <type>
        <types>DefinedType.ВнешнийПользователь</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/ГруппыВнешнихПользователей/ManagerModule.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2022, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ПриНастройкеНачальногоЗаполненияЭлементов(Настройки) Экспорт
	Настройки.ПриНачальномЗаполненииЭлемента = Ложь;
КонецПроцедуры

Процедура ПриНачальномЗаполненииЭлементов(КодыЯзыков, Элементы, ТабличныеЧасти) Экспорт
	Элемент								= Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных	= "ВсеВнешниеПользователи";
	Элемент.Наименование				= "Все внешние пользователи";

	ПустыеСсылки = ПользователиСерверПовтИсп.сП_ПустыеСсылкиТиповОбъектовАвторизации();
	Для Каждого ПустаяСсылка Из ПустыеСсылки Цикл
		ТаблицаНазначение				= ТабличныеЧасти.Назначение; // ТаблицаЗначений
		НоваяСтрока						= ТаблицаНазначение.Добавить();
		НоваяСтрока.ТипПользователей	= ПустаяСсылка;
	КонецЦикла;
	Элемент.Назначение = ТабличныеЧасти.Назначение;
КонецПроцедуры

#КонецЕсли
